#!/bin/bash

# Принимает аргумент - имя файла
if [ "$#" -ne 1 ]; then
    echo "Использование: $0 имя_файла"
    exit 1
fi

FILENAME="$1"

# Проверяем, существует ли файл
if [ ! -f "$FILENAME" ]; then
    echo "Файл не существует. Создание файла и запись 10 случайных строк."
    # Создаем файл и записываем 10 случайных строк
    for i in {1..10}; do
        echo "Случайная строка $RANDOM" >> "$FILENAME"
    done
fi

# Инициализация счетчика строк
line_count=0

# В цикле читает строки из файла и отправляет их на локальный сервер с помощью netcat
while IFS= read -r line; do
    echo "$line" | nc localhost 12345
    ((line_count++))
done < "$FILENAME"

# Вывод сообщения о количестве отправленных строк
echo "Отправлено строк: $line_count"

# Запускает фоновый процесс, который записывает текущее время в файл log.txt каждую минуту
{
    while true; do
        date >> log.txt
        sleep 60
    done
} &

echo "Фоновый процесс запущен. Текущее время записывается в log.txt каждую минуту."
